OpenFOAM-4/chapter2/ellipsoidal/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0); 

boundaryField
{
   front    
    {
        type            wedge;
    }
   back
   {
        type            wedge;
    }
    fixedWall
    {
      type            zeroGradient;
    }
    bottom
    {
	type		fixedValue;
	value		uniform (0 0 0);
    }
    top
    {
        type            zeroGradient;	
    }
    axis            
    {
	type		empty;   
 }    

}
